; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	infrared3 - mode
	thermograph0 - mode
	image1 - mode
	image2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star6 - direction
	Star7 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 infrared3)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument2 infrared3)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon16)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon16)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation8)
)
(:goal (and
	(pointing satellite0 Planet12)
	(pointing satellite2 Planet13)
	(pointing satellite3 GroundStation4)
	(have_image Planet10 infrared3)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 thermograph0)
	(have_image Planet13 image1)
	(have_image Phenomenon14 image2)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 image2)
))

)

; plan
1. (turn_to satellite3 groundstation4 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 groundstation4)
   goals met: 2 of 10
2. (turn_to satellite2 planet13 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 planet13)
   goals met: 3 of 10
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 10
4. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 3 of 10
5. (turn_to satellite1 phenomenon14 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 10
6. (take_image satellite1 phenomenon14 instrument1 image2)
   added: (have_image phenomenon14 image2)
   goals met: 4 of 10
7. (turn_to satellite1 phenomenon11 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 10
8. (turn_to satellite0 groundstation4 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 10
9. (take_image satellite1 phenomenon11 instrument1 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 4 of 10
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 10
11. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 4 of 10
12. (turn_to satellite0 phenomenon16 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 10
13. (take_image satellite0 phenomenon16 instrument0 image2)
   added: (have_image phenomenon16 image2)
   goals met: 5 of 10
14. (turn_to satellite0 planet13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet13)
   goals met: 5 of 10
15. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 6 of 10
16. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 7 of 10
17. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 8 of 10
18. (turn_to satellite1 planet10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet10)
   goals met: 8 of 10
19. (take_image satellite1 planet10 instrument1 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 9 of 10
20. (turn_to satellite1 planet15 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet15)
   goals met: 9 of 10
21. (take_image satellite1 planet15 instrument1 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 10 of 10
